KASTORPROJECT/src/Catalogs/ПрофилиДоступа/ПрофилиДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофилиДоступа</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиВБазах</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.ИнформационныеБазы</types>
      </type>
    </attributes>
    <attributes>
      <name>Активна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KASTORPROJECT/src/Catalogs/РолиВБазах/РолиВБазах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиВБазах</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРолиВКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

KASTORPROJECT/src/Catalogs/ПрофилиДоступа/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура РолиРольПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Роли.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ЗаполнитьСтрокуПоРолиНаСервере(ТекущиеДанные.Роль, ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры         

&НаСервере
Процедура ЗаполнитьСтрокуПоРолиНаСервере(РольСсылка, ИдентификаторСтроки)
    
    Если НЕ ЗначениеЗаполнено(РольСсылка) Тогда
        Возврат;
    КонецЕсли;
    
    СтрокаТЧ = Объект.Роли.НайтиПоИдентификатору(ИдентификаторСтроки);
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    РолиВБазах.ИнформационнаяБаза,
    |    РолиВБазах.Активна,
    |    РолиВБазах.Описание
    |ИЗ
    |    Справочник.РолиВБазах КАК РолиВБазах
    |ГДЕ
    |    РолиВБазах.Ссылка = &Роль";
    
    Запрос.УстановитьПараметр("Роль", РольСсылка);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Если Выборка.Следующий() Тогда
        СтрокаТЧ.ИнформационнаяБаза = Выборка.ИнформационнаяБаза;
        СтрокаТЧ.Активна            = Выборка.Активна;
    КонецЕсли;
    
КонецПроцедуры
